Revit 2027 API
AnalysisDisplayLegendSettings.HeadingTextTypeId Property
 Element id of text associated with legend heading.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId HeadingTextTypeId { get; set; }
Public Property HeadingTextTypeId As ElementId
	Get
	Set
public:
property ElementId^ HeadingTextTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member HeadingTextTypeId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
AnalysisDisplayLegendSettings Class
Autodesk.Revit.DB.Analysis Namespace